#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

a = int(input("a = "))
b = int(input("b = "))


print('Сумма', (a + b))
print('Разность', (a - b))
print('Проезвидение', (a * b))
print('Частное', (a / b))
print(f"Делить с остатком {a //b} (остаток {a % b})")
print(f"Целочисленное деление {int(a) // int(b)}")
